Autodesk.Revit.DB.Structure.LoadCombination.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Structure.LoadCombinationType,Autodesk.Revit.DB.Structure.LoadCombinationState)
Creates a new LoadCombination.
document:
The Document to which new load combination element will be added.
name:
The name of the load combination.
type:
The type of the load combination.
state:
The state of the load combination.
Returns:
The newly created load combination element if successful, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given name is not unique
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.Structure.LoadCombination.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new default LoadCombination.
document:
The Document to which new load combination element will be added.
name:
The name of the load combination.
Returns:
The newly created load combination element if successful, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given name is not unique
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016